Revit 2027 API
Document.Export(String, String, ViewSet, FBXExportOptions) Method
Exports the document in 3D-Studio Max (FBX) format.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Export(
	string folder,
	string name,
	ViewSet views,
	FBXExportOptions options
)
Public Function Export (
	folder As String,
	name As String,
	views As ViewSet,
	options As FBXExportOptions
) As Boolean
public:
bool Export(
	String^ folder,
	String^ name,
	ViewSet^ views,
	FBXExportOptions^ options
)
member Export :
        folder : string *
        name : string *
        views : ViewSet *
        options : FBXExportOptions -> bool
Parameters
folder String
Output folder, into which file(s) will be exported. The folder must exist.
name String
Either the name of a single file or a prefix for a set of files. If null or empty, automatic naming will be used.
views ViewSet
Selection of views to be exported.Only 3D views are allowed.
options FBXExportOptions
Options applicable to the FBX format.
Return Value
Boolean
Function returns true only if all specified views are exported successfully. The function returns False if exporting of any view fails, even if some views might have been exported successfully.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input views is null
ArgumentException |  Thrown when the input views is an empty ViewSet. Thrown if any view in the views is not a 3D view.
Remarks
Though the 'options' argument is not currently used, an object still must be provided (may be null).
See Also
Reference
Document Class
Export Overload
Autodesk.Revit.DB Namespace